{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "distilbert-base-uncased",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 2,
  "lora_dropout": 0.1,
  "modules_to_save": [
    "classifier"
  ],
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "lin2",
    "lin1",
    "v_lin",
    "out_lin",
    "q_lin",
    "k_lin"
  ],
  "task_type": "SEQ_CLS"
}